app/controllers/favorites_controller.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 7]]
---
  def index
    @favorites = current_user.favorites.map do |favorite|

INSERT INTO "favorites" ("user_id", "created_at", "updated_at", "recipe_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 7], ["created_at", "2024-05-25 08:30:56.459700"], ["updated_at", "2024-05-25 08:30:56.459700"], ["recipe_id", 985809]]
---
  def create
    Favorite.create(recipe_id: params["recipe_id"], user_id: current_user.id)

SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 14]]
---
  def destroy
    favorite = Favorite.find(params[:id])
    recipe_id = favorite.recipe_id
    favorite.destroy