app/controllers/recipes_controller.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."recipe_id" = $2 LIMIT $3  [["user_id", 7], ["recipe_id", 132929], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = $1  [["recipe_id", 132929]]
---
  def show
    @recipe = Recipe.search_recipe(params[:id])
    @favorite = current_user.favorites.find_by_recipe_id(params[:id])
    # @recipe_review = Recipe.find_by_id(params[:id])
    # @recipe_review = current_user.f!(recipe_id: params[:recipe_id])
    @recipe_reviews = Review.where(recipe_id: params[:id])