app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.user = current_user
    # @recipe = Recipe.find_by_id(params[:id])
    @review.recipe_id = params["recipe_id"]
    if @review.save!
---
INSERT INTO "reviews" ("user_id", "comment", "created_at", "updated_at", "recipe_id", "rating") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 7], ["comment", "wow"], ["created_at", "2024-05-25 07:32:29.428304"], ["updated_at", "2024-05-25 07:32:29.428304"], ["recipe_id", 132929], ["rating", 2]]